# # def calk1(a, b):
# #     return a + b

# def calk2(a, b):
#     return a * b

# def math(op, x, y):
#     print(op(x, y))

# calk1 = lambda a,b: a + b               # Лямбда функция вместо большой записи можно сразу добавлять в функцию

# math(calk1, 5, 45) 
# # math(lambda a,b: a + b, 5, 45)                 
# math(calk2, 5, 45)

# ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# 1. В списке хранятся числа. Нужно выбрать только четные числа и составить список пар (число, квадрат числа).

# my_list = [1, 2, 3, 5, 8, 15, 23, 38]
# my_list1 = list()

# for i in my_list:
#     if i % 2 == 0:
#         my_list1.append((i, i ** 2))

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# print(my_list1)

# def select(f, col):                                     # вместо select используем map
#     return [f(x) for x in col]

# def where(f, col):                                      # вместо where используем filter
#     return [x for x in col if f(x)]

# my_list = [1, 2, 3, 5, 8, 15, 23, 38]
# res = map(int, my_list)
# res = filter(lambda x: x % 2 == 0, res)
# res = list(map(lambda x: (x, x ** 2), res))
# print(res)

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# функция map превращает строку в числа:

data = '14 123 459 1002 11 34 18'

data = list(map(int, data.split()))
print(data)

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# функция filter фильтрует какие-то значения 2 аргумента сама функция и объект

data = [15, 65, 9, 46, 175]
res = list(filter(lambda x: x % 10 == 5, data))
print(res)

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////